app/controllers/api/v1/clients_controller.rb

  def show
    client = Client.find_by(id: params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def update
    client = Client.find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def destroy
    client = Client.find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]