app/controllers/api/v1/clients_controller.rb

SELECT "clients".* FROM "clients"
---
  def index
    client = Client.all

SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 123456789], ["LIMIT", 1]]
---
  def show
    client = Client.find_by(user_id: params[:id])

SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 794613852], ["LIMIT", 1]]
INSERT INTO "clients" ("user_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 794613852], ["status", 1], ["created_at", "2023-10-05 07:02:43.147705"], ["updated_at", "2023-10-05 07:02:43.147705"]]
---
  def create
    request_data = JSON.parse(params['_json'])
    person = Client.find_by(user_id: request_data['user_id'])
    if !person
      client = Client.new(
        # user_id: client_params[:user_id],
        # status: client_params[:status]
        user_id: request_data['user_id'],
        status: request_data['status']
      )
      if client.save

SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 79461382], ["LIMIT", 1]]
UPDATE "clients" SET "user_id" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["user_id", 79461385269], ["updated_at", "2023-10-05 07:07:04.954912"], ["id", 4]]
---
  def update
    request_data = JSON.parse(params['_json'])
    client = Client.find_by(user_id: params[:id])
    if client
      client.update(
        # user_id: client_params[:user_id],
        # status: client_params[:status]
        user_id: request_data['user_id'],
        status: request_data['status']
      )

SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 794613852691], ["LIMIT", 1]]
DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 1]]
---
  def destroy
    client = Client.find_by(user_id: params[:id])
    if client
      client.destroy