app/controllers/api/v1/crud_controller.rb

  def index
    event = Event.all
---
SELECT "events".* FROM "events"