app/controllers/api/v1/days_controller.rb

SELECT "days".* FROM "days"
---
  def index
    day = Day.all

SELECT "days".* FROM "days" WHERE "days"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    day = Day.find_by(id: params[:id])

SELECT "days".* FROM "days" WHERE "days"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "days" SET "available" = ?, "updated_at" = ? WHERE "days"."id" = ?  [["available", 0], ["updated_at", "2023-09-11 23:28:40.301448"], ["id", 3]]
---
  def update
    day = Day.find(params[:id])
    if day
      day.update(
        cod: day_params[:cod],
        name: day_params[:name],
        available: day_params[:available]
      )

INSERT INTO "days" ("cod", "name", "available", "created_at", "updated_at", "pet_id") VALUES (?, ?, ?, ?, ?, ?)  [["cod", 20], ["name", "Wednesday"], ["available", 1], ["created_at", "2023-09-11 23:27:51.598431"], ["updated_at", "2023-09-11 23:27:51.598431"], ["pet_id", nil]]
---
  def create
    day = Day.new(
      cod: day_params[:cod],
      name: day_params[:name],
      available: day_params[:available])
    if day.save

SELECT "days".* FROM "days" WHERE "days"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "days" WHERE "days"."id" = ?  [["id", 2]]
---
  def destroy
    day = Day.find(params[:id])
    if day
      day.destroy