app/controllers/api/v1/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    event = Event.find_by(id: params[:id])

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "events" SET "cod" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["cod", 2666], ["updated_at", "2023-09-11 23:34:39.163999"], ["id", 2]]
---
  def update
    event = Event.find(params[:id])
    if event
      event.update(
      cod: event_params[:cod],
      title: event_params[:title],
      description: event_params[:description],
      begin: event_params[:begin],
      end: event_params[:end],
      client_ID: event_params[:client_ID],
      creator_ID: event_params[:creator_ID],
      event_type: event_params[:event_type],
      editable: event_params[:editable])

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
---
  def destroy
    event = Event.find(params[:id])
    if event
      event.destroy