app/controllers/api/v1/events_controller.rb

  def index
    event = Event.all
---
SELECT "events".* FROM "events"

  def show
    event = Event.find_by(cod: params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."cod" = ? LIMIT ?  [["cod", 20], ["LIMIT", 1]]

  def create
    request_data = JSON.parse(params['_json'])

    pet = Pet.find_by(pet_id: request_data['pet_id'])
    creator = Client.find_by(user_id: request_data['creator_ID'])
    if creator
      if pet
        event = Event.new(
          # cod: event_params[:cod],
          # title: event_params[:title],
          # description: event_params[:description],
          # begin: event_params[:begin],
          # end: event_params[:end],
          # pet_id: event_params[:pet_id],
          # creator_ID: event_params[:creator_ID],
          # event_type: event_params[:event_type],
          # editable: event_params[:editable])
          cod: request_data['cod'],
          title: request_data['title'],
          description: request_data['description'],
          begin: request_data['begin'],
          end: request_data['end'],
          pet_id: request_data['pet_id'],
          creator_ID: request_data['creator_ID'],
          event_type: request_data['event_type'],
          editable: request_data['editable'])
        if event.save
---
SELECT "pets".* FROM "pets" WHERE "pets"."pet_id" = ? LIMIT ?  [["pet_id", 79132], ["LIMIT", 1]]
SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 1193541561], ["LIMIT", 1]]
INSERT INTO "events" ("cod", "title", "description", "begin", "end", "pet_id", "creator_ID", "event_type", "editable", "created_at", "updated_at", "day_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    request_data = JSON.parse(params['_json'])

    event = Event.find_by(cod: params[:id])
    if event
      event.update(
      # cod: event_params[:cod],
      # title: event_params[:title],
      # description: event_params[:description],
      # begin: event_params[:begin],
      # end: event_params[:end],
      # pet_id: event_params[:pet_id],
      # creator_ID: event_params[:creator_ID],
      # event_type: event_params[:event_type],
      # editable: event_params[:editable])
---
SELECT "events".* FROM "events" WHERE "events"."cod" = ? LIMIT ?  [["cod", 20], ["LIMIT", 1]]
UPDATE "events" SET "cod" = ?, "title" = ?, "description" = ?, "begin" = ?, "end" = ?, "creator_ID" = ?, "event_type" = ?, "editable" = ?, "updated_at" = ? WHERE "events"."id" = ?

  def destroy

    event = Event.find_by(cod: params[:id])
    if event
      event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."cod" = ? LIMIT ?  [["cod", 159], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 31]]