app/controllers/api/v1/pets_controller.rb

  def index
    pet = Pet.all
---
SELECT "pets".* FROM "pets"

  def show
    pet = Pet.find_by(id: params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."pet_id" = ? LIMIT ?  [["pet_id", 789], ["LIMIT", 1]]

  def create
    owner = Client.find_by(user_id: params[:user_id])
    if owner
      pet = Pet.new(
        pet_id: pet_params[:pet_id],
        user_id: pet_params[:user_id]
      )
      if pet.save
---
SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 1193541561], ["LIMIT", 1]]
INSERT INTO "pets" ("pet_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["pet_id", 789], ["user_id", nil], ["created_at", "2023-10-02 15:29:37.434775"], ["updated_at", "2023-10-02 15:29:37.434775"]]

  def update
    pet = Pet.find(params[:id])
      if pet.update(
        pet_id: pet_params[:pet_id],
        name: pet_params[:name],
        breed: pet_params[:breed])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "pets" SET "pet_id" = ?, "breed" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["pet_id", "7777"], ["breed", "Testy"], ["updated_at", "2023-09-11 23:29:43.656362"], ["id", 2]]

  def destroy
    pet = Pet.find(params[:id])
    if pet
      pet.destroy
---
SELECT "pets".* FROM "pets" WHERE "pets"."pet_id" = ? LIMIT ?  [["pet_id", 123], ["LIMIT", 1]]
DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 3]]