app/controllers/api/v1/pets_controller.rb

SELECT "pets".* FROM "pets" WHERE "pets"."pet_id" = ? LIMIT ?  [["pet_id", 7913], ["LIMIT", 1]]
---
  def create
    request_data = JSON.parse(params['_json'])

    owner = Client.find_by(user_id: request_data['user_id'])
    pet = Pet.find_by(pet_id: request_data['pet_id'])

SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 1234567890], ["LIMIT", 1]]
---
  def update
    request_data = JSON.parse(params['_json'])
    owner = Client.find_by(user_id: request_data['user_id'])